{
    "format": "layers-model",
    "generatedBy": "keras v2.6.0",
    "convertedBy": "TensorFlow.js Converter v4.2.0",
    "modelTopology": {
        "keras_version": "2.6.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                200,
                                200,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_1"
                        },
                        "name": "input_1",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 16,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d",
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_1",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 16,
                            "kernel_size": [
                                2,
                                2
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_2",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                2,
                                2
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_3",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_1",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        },
                        "name": "flatten",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 100,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense",
                        "inbound_nodes": [
                            [
                                [
                                    "flatten",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 50,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_1",
                        "inbound_nodes": [
                            [
                                [
                                    "dense",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_2",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_1",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "dense_2",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "binary_crossentropy",
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of8.bin",
                "group1-shard2of8.bin",
                "group1-shard3of8.bin",
                "group1-shard4of8.bin",
                "group1-shard5of8.bin",
                "group1-shard6of8.bin",
                "group1-shard7of8.bin",
                "group1-shard8of8.bin"
            ],
            "weights": [
                {
                    "name": "conv2d/kernel",
                    "shape": [
                        3,
                        3,
                        1,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/kernel",
                    "shape": [
                        3,
                        3,
                        16,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/kernel",
                    "shape": [
                        2,
                        2,
                        32,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_3/kernel",
                    "shape": [
                        2,
                        2,
                        16,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_3/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        80000,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        100,
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/kernel",
                    "shape": [
                        50,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}